app/controllers/admin/posts_controller.rb

SELECT `posts`.* FROM `posts` ORDER BY `posts`.`created_at` ASC, `posts`.`DESC` ASC
SELECT COUNT(*) FROM `posts`
---
	def index
		@page_title = "Kicks4Love Admin | Posts"
		@posts = Post.all.order(:created_at => :DESC)

		if params[:filter].present?
			if params[:filter][:post_type].present?
				@posts = @posts.where(:post_type => params[:filter][:post_type]).order(:created_at => :DESC)
			end
			session[:post_per_page] = params[:filter][:per_page].to_i
		end
		@per_page = session[:post_per_page] || 10
		@posts = @posts.paginate(:page => params[:page] || 1, :per_page => session[:post_per_page] || 10)

INSERT INTO `posts` (`title`, `content`, `image`, `created_at`, `updated_at`) VALUES ('Tiesto', 'Hello', 'logo.png', '2016-11-10 03:07:22', '2016-11-10 03:07:22')
---
	def create
		post = Post.new post_params

		if post.save

UPDATE `posts` SET `content` = 'From neitherland', `updated_at` = '2016-11-10 03:33:41' WHERE `posts`.`id` = 2
---
	def update
		if @post.update_attributes(post_params)

DELETE FROM `posts` WHERE `posts`.`id` = 2
---
	def destroy
		if @post.destroy