app/controllers/main_controller.rb

	def index
		all_posts = Post.order(:created_at => :DESC)
		@news_posts = all_posts.where(:post_type => :NEWS)
		@regular_posts = all_posts.where(:post_type => :POST).paginate(:page => 1)
---
SELECT `posts`.* FROM `posts` ORDER BY `posts`.`created_at` DESC
SELECT `posts`.* FROM `posts` WHERE `posts`.`post_type` = 1 ORDER BY `posts`.`created_at` DESC
SELECT  `posts`.* FROM `posts` WHERE `posts`.`post_type` = 0 ORDER BY `posts`.`created_at` DESC LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM `posts` WHERE `posts`.`post_type` = 0

	def features
		@page_title = 'Kicks4Love | Features'
		@feature_posts = FeaturePost.order(:created_at => :DESC).paginate(:page => 1)
---
SELECT  `feature_posts`.* FROM `feature_posts` ORDER BY `feature_posts`.`created_at` DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `feature_posts`

	def get_posts
		head :ok and return unless params[:next_page].present?

		case params[:source_page]
		when 'index'
			@return_posts = Post.where(:post_type => :POST).paginate(:page => params[:next_page]).order(:created_at => :DESC)
		when 'features'
			@return_posts = FeaturePost.paginate(:page => params[:next_page]).order(:created_at => :DESC)
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`post_type` = 0 ORDER BY `posts`.`created_at` DESC LIMIT 3 OFFSET 3
SELECT COUNT(*) FROM `posts` WHERE `posts`.`post_type` = 0
SELECT  `feature_posts`.* FROM `feature_posts` ORDER BY `feature_posts`.`created_at` DESC LIMIT 3 OFFSET 3
SELECT COUNT(*) FROM `feature_posts`